from math import factorial
def permutations ( n ):
    return int(factorial( n ))
m = permutations( 5 )
print( m )

# Определить сочетания, размещения или перестановки используются для решения этой задачи. !!! ПЕРЕСТАНОВКИ !!!
# Сколькими способами 5 покупателей могут образовать очередь?
